app/views/courses/_form.html.erb

SELECT `teachers`.* FROM `teachers` ORDER BY name
---
    <%= f.label :teacher %><br />
    <%= @teachers = Teacher.all(:order => "name")

SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`course_id` = 1 LIMIT 1
---
    <%= f.label :room %><br />
    <%= @rooms = Room.all(:order => "name")