app/views/courses/show.html.erb

SELECT `course_evaluations`.* FROM `course_evaluations` WHERE `course_evaluations`.`course_id` = 2
---
    <th>Location-Y</th>
    <% @course.course_evaluations.each do |ce| -%>

SELECT `course_students`.* FROM `course_students` WHERE `course_students`.`course_id` = 2
---
  </tr>
  <% @course.course_students.each do |cs| -%>