app/views/courses/students.html.erb

SELECT `course_students`.* FROM `course_students` WHERE `course_students`.`course_id` = 1
SELECT `students`.* FROM `students` WHERE `students`.`id` = 3 LIMIT 1
---

<% @cs_ids = @course.course_students.map { |cs| cs.student.id }