app/controllers/courses_controller.rb

  def show
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def edit
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`created_at`, `name`, `room_id`, `teacher_id`, `updated_at`) VALUES ('2011-12-04 01:56:36', 'Math 5', NULL, NULL, '2011-12-04 01:56:36')

  def update
    @course = Course.find(params[:id])

    respond_to do |format|
      if @course.update_attributes(params[:course])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
UPDATE `courses` SET `room_id` = 2, `teacher_id` = 2, `updated_at` = '2011-12-04 03:34:40' WHERE `courses`.`id` = 1

  def students
    @course = Course.find(params[:id])

    if request.post?
      respond_to do |format|
        if @course.update_students(params[:students])
          format.html { redirect_to :action => :show, :id => @course.id, :notice => 'Course was successfully updated.' }
          format.json { head :ok }
        else
          @course = Course.find(@course.id)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
SELECT `students`.* FROM `students` WHERE `students`.`id` = 2 LIMIT 1

  def position
    @cs = CourseStudent.find(params[:course_student_id])

    if @cs
      @cs.position_x = params[:position_x]
      @cs.position_y = params[:position_y]
      @cs.save
---
SELECT `course_students`.* FROM `course_students` WHERE `course_students`.`id` = 3 LIMIT 1
SELECT `students`.* FROM `students` WHERE `students`.`id` = 2 LIMIT 1
UPDATE `course_students` SET `position_x` = 197.0, `position_y` = 298.0, `updated_at` = '2011-12-04 22:36:45' WHERE `course_students`.`id` = 3

  def evaluation
    @course = Course.find(params[:id])
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 LIMIT 1