app/controllers/students_controller.rb

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`created_at`, `name`, `updated_at`) VALUES ('2011-12-04 00:47:52', 'student1', '2011-12-04 00:47:52')